# Reboot - SQL Advanced

Tonight we will work with the `blog.sqlite` database is available at this URL:  
`https://wagon-public-datasets.s3.amazonaws.com/sql_databases/blog.sqlite`

In [2]:
!curl https://wagon-public-datasets.s3.amazonaws.com/sql_databases/blog.sqlite > data/blog.sqlite

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100  288k  100  288k    0     0  33515      0  0:00:08  0:00:08 --:--:-- 473220  0:00:11  0:00:06  0:00:05 34578

In [4]:
!

README.md   data        recap.ipynb

Let's have a look at our directory structure

In [3]:
!tree

.
├── README.md
├── data
│   └── blog.sqlite
└── recap.ipynb

2 directories, 3 files

## 1. Schema ERD

❓ Open the `data/blog.sqlite` in DBeaver, explore the schema and draw it on [kitt.lewagon.com/db](https://kitt.lewagon.com/db).

_TODO: Double click this cell and **paste** a screenshot of the schema for future reference_.

---
## 2. Most liked posts

Complete the code to get **the 3 most liked posts**:

In [5]:
import sqlite3

conn = sqlite3.connect("data/blog.sqlite")
c = conn.cursor()

# TODO: write the query
query = """
    SELECT 
        COUNT(l.id) like_count,
        p.title
    FROM likes l
    JOIN posts p  ON l.post_id = p.id
    GROUP BY p.id
    ORDER BY like_count DESC
    LIMIT 3
"""

# TODO: Execute the query
c.execute(query)
# TODO: Fetch and print the results
rows = c.fetchall()
rows

[(84, 'Half imagine another.'),
 (82, 'Side foot leader popular.'),
 (81, 'Area paper whatever mean.')]

---

### Pretty Print using _pandas_

The readbility of our `print()` statements is not so good.

Next week, we will introduce [pandas](https://pandas.pydata.org/) which will vastly improve the UX of our data exploration in Notebooks.

Execute the following cell to load `pandas` library:

In [6]:
import pandas as pd

Then try the previous `query` again, delegating the job of fetching results + displaying them to the `read_sql_query` function of `pandas`:

In [7]:
pd.read_sql_query(query, conn)

   like_count                      title
0          84      Half imagine another.
1          82  Side foot leader popular.
2          81  Area paper whatever mean.

---
## 3. Find the three users who 'liked' the most

In [10]:
query = """
    SELECT 
	u.id, 
	u.first_name || " " || u.last_name AS name, 
        COUNT(l.id) AS like_count
    FROM users u
    JOIN likes l ON l.user_id = u.id
    GROUP BY u.id 
    ORDER BY like_count DESC
    LIMIT 3
"""

pd.read_sql_query(query, conn)

   id             name  like_count
0  43    Michael Allen         236
1  12    Donna Ramirez         233
2  44  Hayley Williams         227

---
## 4. Find the most liked author

In [11]:
query = """
    SELECT 
	COUNT(l.id) like_count,
        u.first_name || " " || last_name 
    FROM posts p
    JOIN likes l ON p.id = l.post_id 
    JOIN users u ON u.id  = p.user_id 
    GROUP BY u.id
    ORDER BY like_count DESC
    LIMIT 1
"""

pd.read_sql_query(query, conn)

   like_count u.first_name || " " || last_name
0         647                     Teresa Moore

---
## 5. Who are the authors of the 3 most liked posts?

In [14]:
query = """
    SELECT 
	u.id,
	u.first_name || " " || u.last_name name,
	p.title,
        COUNT(l.id) like_count
    FROM likes l 
    JOIN posts p ON p.id = l.post_id 
    JOIN users u ON u.id = p.user_id
    GROUP BY p.id
    ORDER BY like_count DESC
    LIMIT 3
"""

pd.read_sql_query(query, conn)

   id             name                      title  like_count
0  72    Melissa Henry      Half imagine another.          84
1  63  Cynthia Raymond  Side foot leader popular.          82
2  64   Alexander Cook  Area paper whatever mean.          81

---
## 6. How many people liked at least one post?

In [15]:
query = """
    WITH like_per_post AS (
	SELECT *
	FROM likes l
        GROUP BY l.user_id
    )
    SELECT COUNT(lpp.id)
    FROM like_per_post lpp
"""
# SELECT COUNT(DISTINCT l.user_id)
# FROM likes l

pd.read_sql_query(query, conn)

   COUNT(lpp.id)
0             49

---
## 7. Compute the cumulative number of likes per day

In [ ]:
query = """

"""

pd.read_sql_query(query, conn)

---
## 8. (Optional) Who's the biggest fan/ fans of each author?

The biggest fan/ fans of an author is defined as the user or users who liked the author's posts the most. i.e. if there is a tie between fans that both liked an author 20 times, both fans should be returned alongside their like count and the author in question.
<br><br>
<details>
    <summary>💡 Click for Hint</summary>
    You might need to use <code>WITH</code>
</details>

In [ ]:
query = """

"""

pd.read_sql_query(query, conn)